app/views/users/show.html.erb

  <tbody>
  <%- @user.transactions.each do |t| -%>
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ?  [["user_id", 1]]