app/controllers/transactions_controller.rb

  def summary
    @user = User.where(username: 2456938384156277127).first
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? ORDER BY "users"."id" ASC LIMIT ?  [["username", 2456938384156277127], ["LIMIT", 1]]